app/controllers/boards_controller.rb

  def show
    @board = current_user.boards.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."user_id" = $1 AND "boards"."id" = $2 LIMIT 1  [["user_id", 20], ["id", 20]]

  def create
    @board = Board.new(board_params)

    respond_to do |format|
      if @board.save
---
INSERT INTO "boards" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Nature"], ["user_id", 13], ["created_at", "2016-11-01 17:15:53.023921"], ["updated_at", "2016-11-01 17:15:53.023921"]]

    def edit

      @board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 32]]

  def update
    @board = Board.find(params[:id])
    respond_to do |format|
      if @board.update(board_params)
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 32]]
UPDATE "boards" SET "name" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["name", "Amy Pins!"], ["updated_at", "2016-11-01 17:16:05.722974"], ["id", 13]]

    def set_board
      @board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 32]]