app/controllers/pins_controller.rb

  def index
    @pins = Pin.all
---
SELECT "pins".* FROM "pins"

  def show
    @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 23]]

  def show_by_name
    @pin = Pin.find_by_slug(params[:slug])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."slug" = $1 LIMIT 1  [["slug", "SummerFest"]]

  def create
    @pin = Pin.create(pin_params)
    #@pin = current_user.pins.new(pin_params)
    if @pin.valid?
        @pin.save
        if params[:pin][:pinning][:board_id]
          board = Board.find(params[:pin][:pinning][:board_id])
          @pin.pinnings.create!(user: current_user, board: board)
---
INSERT INTO "pins" ("title", "url", "slug", "text", "category_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 40]]
INSERT INTO "pinnings" ("user_id", "board_id", "pin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 13], ["board_id", 40], ["pin_id", 27], ["created_at", "2016-11-01 17:41:55.539154"], ["updated_at", "2016-11-01 17:41:55.539154"]]

  def edit

    @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 22]]

  def update
    @pin = Pin.find(params[:id])

    #super complicated useless setup!!!
     #@pin.pinnings.find_by(params[board_id: @user.boards, user_id: @user.id]).update_attribute(:board_id, params[:pin][:pinning][:board_id])
debugger
     #another version:
     #@pin = Pin.update(params[:id], pin_params)

     #Pin.update returns the resulting object whether it was saved successfully to the database or not. Therefore, Pin.update(@pin.id, pin_params) does not update the @pin variable if you do not make the assignment; @pin=Pin.update(.....).
     # @pin.update_attributes(pin_params) does change the @pin variable implicitly.
     #The solution for this to work with the update method is to do @pin = Pin.update(@pin.id, pin_params)

    if @pin.update_attributes(pin_params)
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 23]]
UPDATE "pins" SET "title" = $1, "url" = $2, "slug" = $3, "text" = $4, "image_file_name" = $5, "image_content_type" = $6, "image_file_size" = $7, "image_updated_at" = $8, "user_id" = $9 WHERE "pins"."id" = $10

  def repin
    @pin = Pin.find(params[:id])
    board = Board.find(params[:pin][:pinning][:board_id])
    @pin.pinnings.create!(user: current_user, board: board)
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 14]]
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 32]]
INSERT INTO "pinnings" ("user_id", "board_id", "pin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 20], ["board_id", 32], ["pin_id", 14], ["created_at", "2016-11-01 15:19:21.118371"], ["updated_at", "2016-11-01 15:19:21.118371"]]